{
  "token2id": {
    "<PAD>": 0,
    "<SOS>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "__INT__": 4,
    ")": 5,
    "|": 6,
    "(": 7,
    "__IDENT__": 8,
    "chr": 9,
    "=": 10,
    "__STR__": 11,
    "select": 12,
    "from": 13,
    "where": 14,
    "-": 15,
    ",": 16,
    "*": 17,
    "and": 18,
    "or": 19,
    "dual": 20,
    "char": 21,
    "null": 22,
    "end": 23,
    "else": 24,
    "then": 25,
    "case": 26,
    "when": 27,
    "+": 28,
    "as": 29,
    "\"": 30,
    "upper": 31,
    "%": 32,
    "union": 33,
    "all": 34,
    "__HEX__": 35,
    "\\": 36,
    "cast": 37,
    "#": 38,
    "sleep": 39,
    "concat": 40,
    "'": 41,
    "/": 42,
    "in": 43,
    "repeat": 44,
    "count": 45,
    "like": 46,
    "by": 47,
    "benchmark": 48,
    "md5": 49,
    "left": 50,
    "right": 51,
    "floor": 52,
    "group": 53,
    "hex": 54,
    "version": 55,
    "if": 56,
    "order": 57,
    "convert": 58,
    ";": 59,
    "limit": 60,
    "waitfor": 61,
    "delay": 62,
    "<": 63,
    "~": 64,
    "having": 65,
    "min": 66,
    ">": 67,
    "distinct": 68,
    "values": 69,
    "rownum": 70,
    "replace": 71,
    "is": 72,
    "ascii": 73,
    "drop": 74,
    "!": 75,
    ".": 76,
    "not": 77,
    "&": 78,
    "__TIME__": 79,
    "create": 80,
    "substring": 81,
    "true": 82,
    "top": 83,
    "user": 84,
    "lower": 85,
    "on": 86,
    "substr": 87,
    "between": 88
  },
  "id2token": {
    "0": "<PAD>",
    "1": "<SOS>",
    "2": "<EOS>",
    "3": "<UNK>",
    "4": "__INT__",
    "5": ")",
    "6": "|",
    "7": "(",
    "8": "__IDENT__",
    "9": "chr",
    "10": "=",
    "11": "__STR__",
    "12": "select",
    "13": "from",
    "14": "where",
    "15": "-",
    "16": ",",
    "17": "*",
    "18": "and",
    "19": "or",
    "20": "dual",
    "21": "char",
    "22": "null",
    "23": "end",
    "24": "else",
    "25": "then",
    "26": "case",
    "27": "when",
    "28": "+",
    "29": "as",
    "30": "\"",
    "31": "upper",
    "32": "%",
    "33": "union",
    "34": "all",
    "35": "__HEX__",
    "36": "\\",
    "37": "cast",
    "38": "#",
    "39": "sleep",
    "40": "concat",
    "41": "'",
    "42": "/",
    "43": "in",
    "44": "repeat",
    "45": "count",
    "46": "like",
    "47": "by",
    "48": "benchmark",
    "49": "md5",
    "50": "left",
    "51": "right",
    "52": "floor",
    "53": "group",
    "54": "hex",
    "55": "version",
    "56": "if",
    "57": "order",
    "58": "convert",
    "59": ";",
    "60": "limit",
    "61": "waitfor",
    "62": "delay",
    "63": "<",
    "64": "~",
    "65": "having",
    "66": "min",
    "67": ">",
    "68": "distinct",
    "69": "values",
    "70": "rownum",
    "71": "replace",
    "72": "is",
    "73": "ascii",
    "74": "drop",
    "75": "!",
    "76": ".",
    "77": "not",
    "78": "&",
    "79": "__TIME__",
    "80": "create",
    "81": "substring",
    "82": "true",
    "83": "top",
    "84": "user",
    "85": "lower",
    "86": "on",
    "87": "substr",
    "88": "between"
  }
}